In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv("C:/Users/admin/Downloads/student.csv")
df

        name  roll no
0     vineet        1
1     hisham        2
2        raj        3
3      ajeet        4
4      sujit        5
5     ramesh        6
6      priya        7
7   priyanka        8
8     suresh        9
9     ritesh       10
10    hitesh       11
11     jatin       12
12   chitesh       13
13     suman       14
14     raman       15
15      aman       16
16      ravi       17
17    shravi       18
18    chavvi       19
19  himanshu       20

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     20 non-null     object
 1   roll no  20 non-null     int64
dtypes: int64(1), object(1)
memory usage: 452.0+ bytes

In [6]:
df.head()

     name  roll no
0  vineet        1
1  hisham        2
2     raj        3
3   ajeet        4
4   sujit        5

In [7]:
df1=pd.read_csv("C:/Users/admin/Downloads/result.csv")
df

        name  roll no
0     vineet        1
1     hisham        2
2        raj        3
3      ajeet        4
4      sujit        5
5     ramesh        6
6      priya        7
7   priyanka        8
8     suresh        9
9     ritesh       10
10    hitesh       11
11     jatin       12
12   chitesh       13
13     suman       14
14     raman       15
15      aman       16
16      ravi       17
17    shravi       18
18    chavvi       19
19  himanshu       20

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   roll no  20 non-null     int64
 1   result   20 non-null     object
dtypes: int64(1), object(1)
memory usage: 452.0+ bytes

In [9]:
df1.head()

   roll no result
0        1   fail
1        2   fail
2        3   pass
3        4   pass
4        5   fail

In [10]:
df2 = pd.DataFrame({
    "names": ['vineet','hisham','raj','ajeet','sujit','ramesh','priya','priyanka','suresh','ritesh','hitesh','jatin','chitesh','suman','raman','aman','ravi','shravi','chavvi','himanshu'],
    "rno": ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
})

In [11]:
df3 = pd.DataFrame({
    "results": ['fail','fail','pass','pass','fail','pass','fail','pass','pass','pass','pass','fail','fail','fail','pass','fail','pass','fail','pass','pass'],
    "rno": ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
})

In [12]:
combined_df = pd.merge(df2, df3, on='rno')

In [13]:
successfully_passed = combined_df[combined_df['results'] == 'pass']['names']

In [15]:
print("Names of students who have successfully cleared the exam:")
print(successfully_passed.to_list())

Names of students who have successfully cleared the exam:
['raj', 'ajeet', 'ramesh', 'priyanka', 'suresh', 'ritesh', 'hitesh', 'raman', 'ravi', 'chavvi', 'himanshu']

In [16]:
pass_count = (combined_df['results'] == 'pass').sum()
fail_count = (combined_df['results'] == 'fail').sum()

In [17]:
print("Number of students who passed:", pass_count)
print("Number of students who failed:", fail_count)

Number of students who passed: 11
Number of students who failed: 9

In [18]:
sorted_df = combined_df.sort_values(by='names')

In [19]:
print(sorted_df)

       names rno results
3      ajeet   4    pass
15      aman  16    fail
18    chavvi  19    pass
12   chitesh  13    fail
19  himanshu  20    pass
1     hisham   2    fail
10    hitesh  11    pass
11     jatin  12    fail
6      priya   7    fail
7   priyanka   8    pass
2        raj   3    pass
14     raman  15    pass
5     ramesh   6    pass
16      ravi  17    pass
9     ritesh  10    pass
17    shravi  18    fail
4      sujit   5    fail
13     suman  14    fail
8     suresh   9    pass
0     vineet   1    fail